#### Pandas Group By

In [2]:
import pandas as pd
import numpy as np
from pathlib import Path

In [4]:
data = {
    "customer_id": [187, 127, 117, 199, 197, 187, 197, 141, 192, 131, 113],
    "state": ["New York", "New York", "Connecticut", "New Jersey", "Connecticut", 
              "New York", "New York", "New Jersey", "New York", "Connecticut", "New York"],
    "sex": ["Male", "Female", "Female", "Male", "Female", 
            "Male", "Male", "Female", "Male", "Female", "Male"],
    "month": ["August", "August", "July", "July", "August", 
              "June", "June", "June", "August", "July", "August"],
    "year": [2020, 2020, 2020, 2020, 2020, 
             2020, 2020, 2020, 2020, 2020, 2020],
    "purchase_amount": [1000, 5000, 8000, 9000, 2000, 
                        1000, 1000, 3000, 4000, 2000, 10000]
}

df = pd.DataFrame(data)
df

    customer_id        state     sex   month  year  purchase_amount
0           187     New York    Male  August  2020             1000
1           127     New York  Female  August  2020             5000
2           117  Connecticut  Female    July  2020             8000
3           199   New Jersey    Male    July  2020             9000
4           197  Connecticut  Female  August  2020             2000
5           187     New York    Male    June  2020             1000
6           197     New York    Male    June  2020             1000
7           141   New Jersey  Female    June  2020             3000
8           192     New York    Male  August  2020             4000
9           131  Connecticut  Female    July  2020             2000
10          113     New York    Male  August  2020            10000

In [6]:
#Sum of purchase amount 
df.groupby('month').sum()

,customer_id,state,sex,year,purchase_amount
month,,,,,
August,816,New YorkNew YorkConnecticutNew YorkNew York,MaleFemaleFemaleMaleMale,10100,22000
July,447,ConnecticutNew JerseyConnecticut,FemaleMaleFemale,6060,19000
June,525,New YorkNew YorkNew Jersey,MaleMaleFemale,6060,5000

In [8]:
df.groupby('month').groups

{'August': [0, 1, 4, 8, 10], 'July': [2, 3, 9], 'June': [5, 6, 7]}

In [7]:
#Inspect an individual group using the "get group" method
df.groupby('month').get_group('August')

    customer_id        state     sex   month  year  purchase_amount
0           187     New York    Male  August  2020             1000
1           127     New York  Female  August  2020             5000
4           197  Connecticut  Female  August  2020             2000
8           192     New York    Male  August  2020             4000
10          113     New York    Male  August  2020            10000

In [11]:
#Show the sum of purchase amount per month as pd.DataFrame
df.groupby('month').agg("sum")[['purchase_amount']]

        purchase_amount
month
August            22000
July              19000
June               5000

#### Advanced Group By concepts

In [ ]:
df.groupby(["month", "state"]).agg(
    Min=('purchase_amount', 'min'),
    Mean=('purchase_amount', 'mean'),
    Max=('purchase_amount', 'max'),
    Sum=('purchase_amount', 'sum')
)

                     Min    Mean    Max    Sum
month  state
August Connecticut  2000  2000.0   2000   2000
       New York     1000  5000.0  10000  20000
July   Connecticut  2000  5000.0   8000  10000
       New Jersey   9000  9000.0   9000   9000
June   New Jersey   3000  3000.0   3000   3000
       New York     1000  1000.0   1000   2000